#!/usr/bin/env python
# -*- coding: utf-8 -*-
# ---------------------------------------------
# Copyright 2015 for Zen. All Rights Reserved.
# ---------------------------------------------


ShanghaiStockExchange = {
    '600036': '招商银行',
    '601066': '中信建投',
    '601318': '中国平安',
    '601601': '中国太保',
    '601398': '工商银行',
    '601288': '农业银行',
    '600938': '中国海油',
    '601985': '中国核电',
    '601088': '中国神华',
    '600900': '长江电力',
    '600886': '国投电力',
    '600795': '国电电力',
    '600690': '海尔智家',
    '600096': '云化天',
    '600600': '青岛啤酒',
    '600519': '贵州茅台',
    '600887': '伊利股份',
    '600941': '中国移动',
    '601728': '中国电信',
    '601919': '中远海控',
    '600309': '万华化学',
    '601857': '中国石油',
    '600028': '中国石化',
    '600025': '华能水电',
    '601939': '建设银行',
    '601988': '中国银行',
    '601658': '邮储银行',
    '601328': '交通银行',
}


ShenzhenStockExchange = {
    '002142': '宁波银行',
    '003816': '中国广核',
    '000333': '美的集团',
    '000651': '格力电器',
    '000538': '云南白药',
    '000858': '五粮液',
    '000568': '泸州老窖',
}


Stocks = ShanghaiStockExchange | ShenzhenStockExchange


# --------------------------------------------------------


ShanghaiETF = {
    '000016': '上证50',
    '000300': '沪深300',
    '000905': '中证500',
    '000852': '中证1000',
    '000688': '科创50',
    '000092': '中证红利',
    '000985': '中证全指',
    '000510': '中证A500',
}

ShenzhenETF = {
    '399006': '创业板指',
}

OtherETF = {
    'H30269': '红利低波动',
    '931468': '中证红利质量',
}


ETFs = ShanghaiETF | ShenzhenETF | OtherETF


if __name__ == '__main__':
    print(Stocks)
    print(ETFs)
