#!/usr/bin/env python
# -*- coding: utf-8 -*-
# ---------------------------------------------
# Copyright 2015 for Zen. All Rights Reserved.
# ---------------------------------------------


ShanghaiETF = {
    'sh000016': '上证50',
    'sh000300': '沪深300',
    'sh000905': '中证500',
    'sh000852': '中证1000',
    'sh000688': '科创50',
    'sh000092': '中证红利',
    'sh000985': '中证全指',
    'sh000510': '中证A500',
}


ShenzhenETF = {
    'sz399006': '创业板指',
    'sz003816': '中国广核',
    'sz000333': '美的集团',
    'sz000651': '格力电器',
    'sz000538': '云南白药',
    'sz000858': '五粮液',
    'sz000568': '泸州老窖',
}

OtherETF = {
    'csiH30269': '红利低波动',
    'csi931468': '中证红利质量',
}


ETFs = ShanghaiETF | ShenzhenETF | OtherETF


if __name__ == '__main__':
    print(ETFs)
