#!/usr/bin/env python
# -*- coding: utf-8 -*-
# ---------------------------------------------
# Copyright 2015 for Zen. All Rights Reserved.
# ---------------------------------------------


ShanghaiStockExchange = {
    'sh600036': '招商银行',
    'sh601066': '中信建投',
    'sh601318': '中国平安',
    'sh601601': '中国太保',
    'sh601398': '工商银行',
    'sh601288': '农业银行',
    'sh600938': '中国海油',
    'sh601985': '中国核电',
    'sh601088': '中国神华',
    'sh600900': '长江电力',
    'sh600886': '国投电力',
    'sh600795': '国电电力',
    'sh600690': '海尔智家',
    'sh600096': '云化天',
    'sh600600': '青岛啤酒',
    'sh600519': '贵州茅台',
    'sh600887': '伊利股份',
    'sh600941': '中国移动',
    'sh601728': '中国电信',
    'sh601919': '中远海控',
    'sh600309': '万华化学',
    'sh601857': '中国石油',
    'sh600028': '中国石化',
    'sh600025': '华能水电',
    'sh601939': '建设银行',
    'sh601988': '中国银行',
    'sh601658': '邮储银行',
    'sh601328': '交通银行',
}


ShenzhenStockExchange = {
    'sz002142': '宁波银行',
    'sz003816': '中国广核',
    'sz000333': '美的集团',
    'sz000651': '格力电器',
    'sz000538': '云南白药',
    'sz000858': '五粮液',
    'sz000568': '泸州老窖',
}

Stocks = ShanghaiStockExchange | ShenzhenStockExchange


if __name__ == '__main__':
    print(Stocks)
